## Curso SQL - Píldoras Informáticas

Para poder trabajar debemos realizar unos pasos previos:
- Usar Apache + mysql usando XAMPP
- Crear la base de datos
- Importar los datos
- Crear el usuario y darle privilegios

**IMPORTANTE:** Siempre necesitarás tener el Apache y el MYSQL activo desde el XAMPP.

Tras esta iniciación, ya podemos conectar con la BBDD usando el engine de SQLAlchemy.

In [1]:
import sqlalchemy

Para conectar, le pasamos por parámetro la información de la base de datos y del usuario, usando la siguiente fórmula fórmula:

`'conector://username:password@hostname/db_name'`

In [2]:
sqlalchemy.create_engine('mysql://scott:tiger@localhost/Curso_SQL')

Engine(mysql://scott:***@localhost/Curso_SQL)

In [3]:
%load_ext sql

Finalmente conectamos:

In [4]:
%sql mysql://scott:tiger@localhost/Curso_SQL

Ya podemos hacer consultas a la tabla:

In [5]:
%%sql

SELECT EMPRESA, DIRECCIÓN, POBLACIÓN
FROM CLIENTES

 * mysql://scott:***@localhost/Curso_SQL
38 rows affected.

[('BELTRÁN E HIJOS', 'LAS FUENTES 78', 'MADRID'),
 ('LA MODERNA', 'LA PALOMA 123', 'OVIEDO'),
 ('EL ESPAÑOLITO', 'MOTORES 34', 'BARCELONA'),
 ('EXPORTASA', 'VALLECAS 34', 'MADRID'),
 ('CONFECCIONES AMPARO', 'LOS MOROS 23', 'GIJÓN'),
 ('LA CASA DEL JUGUETE', 'AMÉRICA 45', 'MADRID'),
 ('JUGUETERÍA SUÁREZ', 'PARIS 123', 'BARCELONA'),
 ('ALMACÉN POPULAR', 'LAS FUENTES 124', 'BILBAO'),
 ('FERETERÍA EL CLAVO', 'PASEO DE ÁLAMOS 78', 'MADRID'),
 ('JUGUETES MARTÍNEZ', 'VIA LAYETANA 245', 'BARCELONA'),
 ('FERNÁNDEZ SL', 'PASEO DEL MAR 45', 'SANTANDER'),
 ('CONFECCIONES ARTÍMEZ', 'GENERAL PERÓN 45', 'A CORUÑA'),
 ('DEPORTES GARCÍA', 'GUZMÁN EL BUENO 45', 'MADRID'),
 ('EXCLUSIVAS FERNÁNDEZ', 'LLOBREGAT 250', 'BARCELONA'),
 ('DEPORTES MORÁN', 'AUTONOMÍA 45', 'LUGO'),
 ('BAZAR FRANCISCO', 'CARMEN 45', 'ZAMORA'),
 ('JUGUETES LA SONRISA', 'LA BAÑEZA 67', 'LEÓN'),
 ('CONFECCIONES GALÁN', 'FUENCARRAL 78', 'MADRID'),
 ('LA CURTIDORA', 'OLIVARES 3', 'MÁLAGA'),
 ('LÍNEA JOVEN', 'SIERPES 78', 'SEVILLA'),
 ('BAZAR EL BARAT', 'DIAGONAL 56', 'BARCELONA'),
 ('EL PALACIO DE LA MODA', 'ORTEGA Y GASSET 129', 'MADRID'),
 ('SÁEZ Y CÍA', 'INFANTA MERCEDS 23', 'SEVILLA'),
 ('DEPORTES EL MADRILEÑO', 'CASTILLA 345', 'ZARAGOZA'),
 ('FERRETERÍA LA ESCOBA', 'ORENSE 7', 'MADRID'),
 ('JUGUETES EL BARATO', 'VÍA AUGUSTA 245', 'BARCELONA'),
 ('CONFECCIONES HERMINIA', 'CORRIDA 345', 'GIJÓN'),
 ('BAZAR EL ARGENTINO', 'ATOCHA 55', 'MADRID'),
 ('LA TIENDA ELEGANTE', 'EL COMENDADOR 67', 'ZARAGOZA'),
 ('DEPORTES NAUTICOS GARCÍA', 'JUAN FERNÁNDEZ 89', 'ÁVILA'),
 ('CONFECCIONES RUIZ', 'LLOBREGAT 345', 'BARCELONA'),
 ('BAZAR LA FARAONA', 'CASTILLA Y LEÓN 34', 'MADRID'),
 ('FERRETERÍA EL MARTILLO', 'CASTELLANOS 205', 'SALAMANCA'),
 ('JUGUETES EDUCATIVOS SANZ', 'ORENSE 89', 'MADRID'),
 ('ALMACENES FERNANDEZ', 'ANTÓN 67', 'TERUEL'),
 ('CONFECCIONES MÓNICA', 'MOTORES 67', 'BARCELONA'),
 ('FERRETERÍA LIMA', 'VALLECAS 45', 'MADRID'),
 ('DEPORTES EL BRASILEÑO', 'ABEL MARTÍNEZ 67', 'SALAMANCA')]

- `SELECT`: Seleccionamos Los campos
- `FROM`: Seleccionamos la tabla
- `WHERE`: Sentencia condicional, con campo y criterio, usando un operador

In [6]:
%%sql

SELECT NOMBREARTÍCULO, SECCIÓN, PRECIO
FROM PRODUCTOS
WHERE SECCIÓN = "CERÁMICA" or SECCIÓN = "DEPORTES"

 * mysql://scott:***@localhost/Curso_SQL
16 rows affected.

[('RAQUETA TENIS', 'DEPORTES', '93,47'),
 ('MANCUERNAS', 'DEPORTES', '60,00'),
 ('TUBOS', 'CERÁMICA', '168,43'),
 ('PLATO DECORATIVO', 'CERÁMICA', '54,09'),
 ('PISTOLA OLÍMPICA', 'DEPORTES', '46,73'),
 ('JUEGO DE TE', 'CERÁMICA', '43,27'),
 ('CENICERO', 'CERÁMICA', '19,75'),
 ('BALÓN RUGBY', 'DEPORTES', '111,64'),
 ('BALÓN BALONCESTO', 'DEPORTES', '75,27'),
 ('BALÓN FÚTBOL', 'DEPORTES', '43,91'),
 ('CRONÓMETRO', 'DEPORTES', '439,18'),
 ('MACETA', 'CERÁMICA', '29,04'),
 ('CAÑA DE PESCA', 'DEPORTES', '270,00'),
 ('JARRA CHINA', 'CERÁMICA', '127,77'),
 ('BOTA ALPINISMO', 'DEPORTES', '144,00'),
 ('PALAS DE PING PONG', 'DEPORTES', '21,60')]

Hay varios operadores para la sentencia where, como `and` y `or`. Se pueden concatenar.

In [9]:
%%sql

SELECT *
FROM PRODUCTOS
WHERE SECCIÓN = "DEPORTES" and PAÍSDEORIGEN = "USA"

 * mysql://scott:***@localhost/Curso_SQL
5 rows affected.

[('AR04', 'DEPORTES', 'RAQUETA TENIS', Decimal('93.0000'), None, 'VERDADERO', 'USA', None),
 ('AR06', 'DEPORTES', 'MANCUERNAS', Decimal('60.0000'), None, 'VERDADERO', 'USA', None),
 ('AR24', 'DEPORTES', 'BALÓN RUGBY', Decimal('111.0000'), None, 'VERDADERO', 'USA', None),
 ('AR32', 'DEPORTES', 'CRONÓMETRO', Decimal('439.0000'), None, 'VERDADERO', 'USA', None),
 ('AR38', 'DEPORTES', 'CAÑA DE PESCA', Decimal('270.0000'), None, 'VERDADERO', 'USA', None)]

Los campos `PRECIO` y `DATE` pueden dar error al hacer querys por no estar correctamente tipados. Se debe cambiar el formato de dato desde los archivos .ods. Al volver a importar la tabla detectará automáticamente que el campo PRECIO es decimal 10,4 pero habrá que cambiar manualmente el campo FECHA a tipo `date`.

Podremos usar la sentencia `BETWEEN` para solicitar un intervalo de datos. Es lo mismo que usar directamente operadores `>=` y `<=`.

In [11]:
%%sql

SELECT *
FROM PRODUCTOS
WHERE FECHA
BETWEEN '2000-03-01' and '2000-04-30'

 * mysql://scott:***@localhost/Curso_SQL
4 rows affected.

[('AR04', 'DEPORTES', 'RAQUETA TENIS', Decimal('93.4694'), datetime.date(2000, 3, 20), 'VERDADERO', 'USA', None),
 ('AR08', 'JUGUETERÍA', 'CORREPASILLOS', Decimal('103.3356'), datetime.date(2000, 4, 11), 'VERDADERO', 'JAPÓN', None),
 ('AR16', 'FERRETERÍA', 'ALICATES', Decimal('6.7362'), datetime.date(2000, 4, 17), 'VERDADERO', 'ITALIA', None),
 ('AR19', 'CONFECCIÓN', 'BLUSA SRA.', Decimal('101.0566'), datetime.date(2000, 3, 18), 'VERDADERO', 'CHINA', None)]